#lets try to bring in the csv file here

In [2]:
import pandas as pd
#
df = pd.read_csv("City Rating.csv")

In [3]:
df

   Unnamed: 0       city  temp10  temp11  empty_temp
0           0         KL      45      12         NaN
1           1         NY      32      30         NaN
2           2    Jakarta      87      45         NaN
3           3      Delhi      67      80         NaN
4           4  Hong Kong      54      60         NaN

In [4]:
df2 = pd.read_csv("City Rating eithout row numners.csv")
df2

        city  temp10  temp11  empty_temp
0         KL      45      12         NaN
1         NY      32      30         NaN
2    Jakarta      87      45         NaN
3      Delhi      67      80         NaN
4  Hong Kong      54      60         NaN

In [ ]:
df3 = pd.read_csv() # to read

In [4]:
df

   Unnamed: 0       city  temp10  temp11  empty_temp
0           0         KL      45      12         NaN
1           1         NY      32      30         NaN
2           2    Jakarta      87      45         NaN
3           3      Delhi      67      80         NaN
4           4  Hong Kong      54      60         NaN